app/Controllers/Admin.php

UPDATE `jogadores` SET `estado` = 'inativo'
WHERE `id_jogador` = '54'
---
    public function apagar_jogadores($id)
    {

        $dados = [
            'estado' => 'inativo'
        ];

        $db = db_connect();

        $db->table('jogadores')->where('id_jogador', $id)->update($dados);